Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/ef_data_0_reg.h
    /* 0x4 : ef_dbg_pwd_low */
    union {
        struct
        {
            uint32_t ef_dbg_pwd_low : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_dbg_pwd_low;

    /* 0x8 : ef_dbg_pwd_high */
    union {
        struct
        {
            uint32_t ef_dbg_pwd_high : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_dbg_pwd_high;

    /* 0xC : ef_ana_trim_0 */
    union {
        struct
        {
            uint32_t ef_ana_trim_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_ana_trim_0;

    /* 0x10 : ef_sw_usage_0 */
    union {
        struct
        {
            uint32_t ef_sw_usage_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_sw_usage_0;

    /* 0x14 : ef_wifi_mac_low */
    union {
        struct
        {
            uint32_t ef_wifi_mac_low : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_wifi_mac_low;

    /* 0x18 : ef_wifi_mac_high */
    union {
        struct
        {
            uint32_t ef_wifi_mac_high : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_wifi_mac_high;

    /* 0x1C : ef_key_slot_0_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_0_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_0_w0;

    /* 0x20 : ef_key_slot_0_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_0_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_0_w1;

    /* 0x24 : ef_key_slot_0_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_0_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_0_w2;

    /* 0x28 : ef_key_slot_0_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_0_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_0_w3;

    /* 0x2C : ef_key_slot_1_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_1_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_1_w0;

    /* 0x30 : ef_key_slot_1_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_1_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_1_w1;

    /* 0x34 : ef_key_slot_1_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_1_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_1_w2;

    /* 0x38 : ef_key_slot_1_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_1_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_1_w3;

    /* 0x3C : ef_key_slot_2_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_2_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_2_w0;

    /* 0x40 : ef_key_slot_2_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_2_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_2_w1;

    /* 0x44 : ef_key_slot_2_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_2_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_2_w2;

    /* 0x48 : ef_key_slot_2_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_2_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_2_w3;

    /* 0x4C : ef_key_slot_3_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_3_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_3_w0;

    /* 0x50 : ef_key_slot_3_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_3_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_3_w1;

    /* 0x54 : ef_key_slot_3_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_3_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_3_w2;

    /* 0x58 : ef_key_slot_3_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_3_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_3_w3;

    /* 0x5C : ef_key_slot_4_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_4_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w0;

    /* 0x60 : ef_key_slot_4_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_4_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w1;

    /* 0x64 : ef_key_slot_4_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_4_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w2;

    /* 0x68 : ef_key_slot_4_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_4_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w3;

    /* 0x6C : ef_key_slot_5_w0 */
    union {
        struct
        {
            uint32_t ef_key_slot_5_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w0;

    /* 0x70 : ef_key_slot_5_w1 */
    union {
        struct
        {
            uint32_t ef_key_slot_5_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w1;

    /* 0x74 : ef_key_slot_5_w2 */
    union {
        struct
        {
            uint32_t ef_key_slot_5_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w2;

    /* 0x78 : ef_key_slot_5_w3 */
    union {
        struct
        {
            uint32_t ef_key_slot_5_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w3;

    /* 0x7C : ef_data_0_lock */
    union {
        struct
        {
            uint32_t ef_ana_trim_1        : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4_l : 1;  /* [   13],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5_l : 1;  /* [   14],        r/w,        0x0 */
            uint32_t wr_lock_boot_mode    : 1;  /* [   15],        r/w,        0x0 */
            uint32_t wr_lock_dbg_pwd      : 1;  /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_0   : 1;  /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_wifi_mac     : 1;  /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_0   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_1   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_2   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_3   : 1;  /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4_h : 1;  /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5_h : 1;  /* [   24],        r/w,        0x0 */
            uint32_t rd_lock_dbg_pwd      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_0   : 1;  /* [   26],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_1   : 1;  /* [   27],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_2   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_3   : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_4   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_5   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_data_0_lock;
};

typedef volatile struct ef_data_0_reg ef_data_0_reg_t;

#endif /* __EF_DATA_0_REG_H__ */
